app/controllers/memopads_controller.rb

SELECT * FROM "memopads"
---
  def index
    @memopads = Memopad.all

SELECT * FROM "memopads" WHERE ("memopads"."id" = 1)
---
  def show
    @memopad = Memopad.find(params[:id])

INSERT INTO "memopads" ("created_at", "title", "updated_at", "due") VALUES('2010-05-30 03:20:44', 'ABCDEFG', '2010-05-30 03:20:44', '2010-05-28')
---
  def create
    @memopad = Memopad.new(params[:memopad])

    respond_to do |format|
      if @memopad.save